[
    {
        "question": "Часто ли вы чувствуете, что ваши усилия не ценят и не замечают?",
        "type": "A"
    },
    {
        "question": "Считаете ли вы, что люди вокруг вас часто относятся к вам несправедливо?",
        "type": "A"
    },
    {
        "question": "Склонны ли вы выбирать отношения, где чувствуете себя недооценённым?",
        "type": "A"
    },
    {
        "question": "Чувствуете ли вы постоянную нехватку внимания и признания?",
        "type": "A"
    },
    {
        "question": "Часто ли обижаетесь и ощущаете себя жертвой несправедливости?",
        "type": "A"
    },
    {
        "question": "Бывает ли у вас желание отомстить или доказать свою правоту обидевшим вас людям?",
        "type": "A"
    },
    {
        "question": "С трудом доверяете другим, ожидая от них несправедливых действий?",
        "type": "A"
    },
    {
        "question": "Замечаете ли вы, что неосознанно провоцируете ситуации, где чувствуете себя несправедливо обделённым?",
        "type": "A"
    },
    {
        "question": "Обижаетесь ли вы, когда начальник присваивает ваши заслуги или не упоминает ваш вклад?",
        "type": "A"
    },
    {
        "question": "Чувствуете ли вы, что членам семьи «должны» получать от вас больше, чем вы сами готовы дать?",
        "type": "A"
    },
    {
        "question": "Вспоминаете ли вы болезненные ситуации или травмы, которые воспринимали как «не заслуженные» страдания?",
        "type": "A"
    },
    {
        "question": "Обижаетесь ли вы, когда друзья не замечают или не поздравляют вас с важным личным достижением?",
        "type": "A"
    },
    {
        "question": "Легко ли вас «зацепить» словом или действием, которое вы воспринимаете как нечестное обращение?",
        "type": "A"
    },
    {
        "question": "Бывает ли, что вы одновременно хотите и наказать обидевшего вас человека, и помириться, чувствуя вину за свою агрессию?",
        "type": "A"
    },
    {
        "question": "Часто ли чувствуете себя лишним или ненужным в компании?",
        "type": "B"
    },
    {
        "question": "Боитесь ли вы сближения из страха быть отвергнутым?",
        "type": "B"
    },
    {
        "question": "Считаете ли вы, что не заслуживаете любви и внимания, если «не делаете в обмен за это что-то хорошее»?",
        "type": "B"
    },
    {
        "question": "Тяжело ли переносите ситуации возможного отвержения или осуждения?",
        "type": "B"
    },
    {
        "question": "Часто ли заранее избегаете контакта, опасаясь прожить боль разочарования или ощущения «что со мной что-то не так»?",
        "type": "B"
    },
    {
        "question": "Испытываете ли вы грусть, если вас не приглашают на мероприятия?",
        "type": "B"
    },
    {
        "question": "Чувствительны ли вы к словам и поступкам других, воспринимая их лично?",
        "type": "B"
    },
    {
        "question": "Предпочитаете ли вы одиночество, чтобы избежать повторения боли отвержения?",
        "type": "B"
    },
    {
        "question": "Боитесь ли вы провести переговоры/выступление/собеседование или презентацию так, что «никто больше не пригласит» и из-за этого лишний раз избегаете проявляться?",
        "type": "B"
    },
    {
        "question": "Чувствуете ли вы, что вас не ждут за столом, если вы пришли домой немного позже?",
        "type": "B"
    },
    {
        "question": "Испытываете ли вы тревогу, когда посещаете врача в одиночку?",
        "type": "B"
    },
    {
        "question": "Обижаетесь ли вы, если друзья были онлайн, но не отвечают сразу?",
        "type": "B"
    },
    {
        "question": "Легко ли у вас просыпается тревожность при паузе в переписке или созвонах?",
        "type": "B"
    },
    {
        "question": "Испытываете ли вы одновременно желание сбежать от людей и сильную боль из-за своей изоляции?",
        "type": "B"
    },
    {
        "question": "Вам трудно доверять людям?",
        "type": "C"
    },
    {
        "question": "Проверяете ли вы близких людей на верность и честность?",
        "type": "C"
    },
    {
        "question": "Сложно ли вам простить обиды и нарушение обещаний?",
        "type": "C"
    },
    {
        "question": "Испытываете ли вы страх, что вас обманут или подведут?",
        "type": "C"
    },
    {
        "question": "Предпочитаете ли вы контролировать ситуацию, избегая неожиданностей?",
        "type": "C"
    },
    {
        "question": "Тяжело ли вы переносите несоблюдение обещаний другими людьми?",
        "type": "C"
    },
    {
        "question": "Склонны ли вы к ревности и подозрительности без явных причин?",
        "type": "C"
    },
    {
        "question": "Воспринимаете ли вы изменение планов как угрозу?",
        "type": "C"
    },
    {
        "question": "Боитесь ли вы, подписывая контракт или соглашение, что вас могут «подставить»?",
        "type": "C"
    },
    {
        "question": "Бывает ли, что вы проверяете переписки близких на предмет «секретов/измен»?",
        "type": "C"
    },
    {
        "question": "Чувствуете ли вы недоверие к рекомендациям врачей?",
        "type": "C"
    },
    {
        "question": "Просматриваете ли вы истории или лайки от друзей, чтобы убедиться, что вас не игнорируют?",
        "type": "C"
    },
    {
        "question": "Обижает ли вас даже намек на «пустые обещания» — и вы тут же закрываетесь?",
        "type": "C"
    },
    {
        "question": "Хотите довериться человеку и одновременно боитесь быть обманутым, даже если нет оснований?",
        "type": "C"
    },
    {
        "question": "Часто ли чувствуете себя менее значимым, чем другие?",
        "type": "D"
    },
    {
        "question": "Тяжело ли вы переносите шутки в ваш адрес?",
        "type": "D"
    },
    {
        "question": "Часто ли критикуете себя и принижаете собственные достижения?",
        "type": "D"
    },
    {
        "question": "Сложно ли вам принимать комплименты, считая их незаслуженными?",
        "type": "D"
    },
    {
        "question": "Испытываете ли вы трудности с выражением своего мнения?",
        "type": "D"
    },
    {
        "question": "Часто ли испытываете стыд за свои действия или внешность?",
        "type": "D"
    },
    {
        "question": "Боитесь ли вы публичных выступлений и ситуаций, привлекающих внимание?",
        "type": "D"
    },
    {
        "question": "Воспринимаете ли вы любое замечание, как обесценивание/унижение?",
        "type": "D"
    },
    {
        "question": "Избегаете ли вы просить повышения, боясь выглядеть слишком самоуверенно, считаете, что это не заслуженно, или что могут «забрать» то что хорошо сейчас?",
        "type": "D"
    },
    {
        "question": "Чувствуете ли вы стыд перед родственниками?",
        "type": "D"
    },
    {
        "question": "Испытываете ли вы стыд за физические особенности тела (шрамы, лишний вес) и прячетесь из-за этого?",
        "type": "D"
    },
    {
        "question": "Воспринимаете ли вы безобидные замечания как указание на ваши личные недостатки?",
        "type": "D"
    },
    {
        "question": "Легко ли вы краснеете или опускаете глаза, услышав критику, даже если она конструктивна?",
        "type": "D"
    },
    {
        "question": "Чувствуете ли вы одновременно желание принять комплимент и непреодолимый дискомфорт от него?",
        "type": "D"
    },
    {
        "question": "Боитесь ли вы потерять близких людей?",
        "type": "E"
    },
    {
        "question": "Сложно ли вам переживать разлуку?",
        "type": "E"
    },
    {
        "question": "Испытываете ли вы тревогу от мысли остаться в одиночестве?",
        "type": "E"
    },
    {
        "question": "Быстро ли и сильно вы привязываетесь к людям?",
        "type": "E"
    },
    {
        "question": "Сложно ли вам переносить неопределённость в отношениях?",
        "type": "E"
    },
    {
        "question": "Важно ли вам постоянно получать подтверждение любви от партнёра?",
        "type": "E"
    },
    {
        "question": "Часто ли представляете негативные сценарии разрыва отношений?",
        "type": "E"
    },
    {
        "question": "Избегаете ли вы выражать несогласие, боясь остаться в одиночестве?",
        "type": "E"
    },
    {
        "question": "Боитесь ли вы искать новую работу, опасаясь, что там будет хуже?",
        "type": "E"
    },
    {
        "question": "Испытываете ли вы чувство тревоги, если на мероприятии вас не посадили рядом с близким человеком?",
        "type": "E"
    },
    {
        "question": "Откладываете ли вы визит к врачу, чтобы «лишний раз никому не надоедать, просьбой побыть с вами»?",
        "type": "E"
    },
    {
        "question": "Отписываете ли вы друзей в соцсетях после конфликта, чтобы избежать чувства брошенности?",
        "type": "E"
    },
    {
        "question": "Испытываете ли вы сильное беспокойство, когда близкие планируют выходные или отпуск без вашего участия?",
        "type": "E"
    },
    {
        "question": "Сильно ли вы хотите поддержки и одновременно не даёте её другим, опасаясь близости?",
        "type": "E"
    }
]